[
    {
        "name": "Baker Mayfield",
        "description": "Baker Mayfield began his college football career as a walk-on player for the Texas Tech Red Raiders. Mayfield transferred from Texas Tech to Oklahoma following supposed scholarship issues and a lack of communication with coaches. After sitting out the 2014 season due to NCAA transfer rules, Mayfield won the starting quarterback job in 2015. He won several awards for his performance as a senior in 2017, including the Heisman Trophy, Maxwell Award, Walter Camp Award, and unanimous All-America recognition. Mayfield was drafted by the Browns first overall in the 2018 NFL Draft. In his first NFL appearance, Mayfield led Cleveland to their first win in 19 games, ending a 635-day winless streak. He threw 27 touchdowns in his 13 starts for the Browns in 2018, breaking the rookie-season passing-TD record of 26 held by Peyton Manning and Russell Wilson.",
        "image_source": "https://larrybrownsports.com/wp-content/uploads/2019/11/baker-mayfield.jpg",
        "url": "Baker"
    },
    {
        "name": "Odell Beckham Jr & Jarvis Landry",
        "description": "Beckham and Landry grew up in Louisiana. Beckham was born in raised in Baton Rouge and went to high school in New Orleans; Landry was born in Convent and went to Lutcher High. They met at a 7-on-7 camp in Alabama during high school and became fast friends and eventually best friends. They quickly hatched a plan to attend the same college — LSU was the choice — with the ultimate dream of playing together in the NFL. A poignant Nike commercial released Monday chronicles their journeys with the tagline “Ready to make history … together.” In Cleveland.",
        "image_source": "https://www.cleveland.com/resizer/aDVcVzGVqtMq0dRB8WqI0ZVp1fA=/450x0/smart/arc-anglerfish-arc2-prod-advancelocal.s3.amazonaws.com/public/CHIMR3TR25B4XMBU3UYQ2YE23U.JPG",
        "url": "OBJ and Jarvis"
    },
    {
        "name": "Nick Chubb",
        "description": "Nick Chubb played college football at Georgia and was drafted by the Browns in the second round of the 2018 NFL Draft. Chubb attended Cedartown High School in Cedartown, Georgia, where he was a two-sport star for the Bulldogs; football and track teams. He finished his high school career with 6,983 rushing yards and 102 rushing touchdowns. As a standout track & field athlete, Chubb competed from 2011 to 2015 in events ranging from the 100-meters to the shot put. At the 2014 4A Sectionals, he won the shot put event, recording a top-throw of 17.05 meters (55 ft, 8in), and earned second-place finishes in both the 100-meter dash, with a time of 10.69 seconds (setting a school record), and the 200-meter dash, with a time of 21.83 seconds. In June 2013, he committed to the University of Georgia to play college football under head coach Mark Richt.",
        "image_source": "https://usatbrownswire.files.wordpress.com/2018/11/usatsi_11656746.jpg?w=1000&h=600&crop=1",
        "url": "Chubb"
    },
    {
        "name": "Myles Garrett",
        "description": "Myles Garrett played college football at Texas A&M and was drafted by the Browns first overall in the 2017 NFL Draft. Garrett was the highest-rated defensive player ever recruited by Texas A&M, where he became a two-time All-American while playing for the Aggies, racking up numerous other awards for his stellar defensive play. Upon joining the Browns, his rookie season was limited due to injuries, but Garrett emerged after the latter half of that year and has become one of the premier edge rushers in the NFL. In 2019, Garrett was suspended indefinitely for a fight occurring in a game against the Pittsburgh Steelers before being reinstated in early 2020.",
        "image_source": "https://img8.ntm.eu/sm/public/img/5276749/1115204518/clevelands-myles-garrett-till?w=640&h=360&anchor=topcenter&bgcolor=222&scale=both",
        "url": "Garrett"
    },
    {
        "name": "Denzel Ward",
        "description": "Denzel Ward attended Nordonia High School in Macedonia, Ohio. He played cornerback and wide receiver for the Knights football team. He also ran track. As a senior at the Division 1 region 1 finals, he ran a personal best time of 10.49 seconds in the 100 meters, placing 1st. His personal best in the 200 meters is 21.38 seconds, in which he placed third at the state championships. He committed to The Ohio State University to play college football and later on got drafted by the Cleveland Browns, meaning that he has been able to spend his entire career so far at home in Ohio. He was a bit of an off the board-pick for the John Dorsey-led Browns when he was chosen fourth overall. Leading up to the draft, Ward was being projected as a fringe top ten-player.",
        "image_source": "https://mk0brownsnation85l0k.kinstacdn.com/wp-content/uploads/2020/04/DCT191110055_BUF_at_CLE.jpg",
        "url": "Ward"
    },
    {
        "name": "Larry Ogunjobi",
        "description": "Larry Ogunjobi played college football at Charlotte before being drafted by the Browns with the 65th overall pick in the 2017 NFL Draft. Ogunjobi attended Ragsdale High School in Jamestown, North Carolina. While in college, he recorded 217 tackles and 13 sacks. At Charlotte he double-majored in computer science and biology, graduating with a degree in computer science in December 2016. Ogunjobi was originally projected to be a fifth or sixth round pick. He received an invitation to the 2017 Senior Bowl, practiced well throughout the week, and ultimately raised his draft stock considerably.",
        "image_source": "https://www.brownszone.com/wp-content/uploads/sites/8/2019/11/AP_19281836286210.jpg",
        "url": "Larry"
    },
    {
        "name": "Joel Bitonio",
        "description": "Joel Bitonio was drafted by the Browns in the second round of the 2014 NFL Draft. He played college football at Nevada. Bitonio attended Long Beach Wilson High School in Long Beach, California, where he was a three-sport star. He was named to the Long Beach Press Telegram's Dream Team for football and basketball as a senior. In football, he was a two-time All-league selection and was the Moore League Lineman of the Year. He was a first-team All-conference selection and was named second-team All-state by MaxPreps.com. Bitonio also lettered in track & field as a senior. He led the league in the shot put, recording a top-throw of 15.39 meters at the 2009 CIF Southern Section Division 1 Prelims.",
        "image_source": "https://images.radio.com/wkrkfm/USATSI_13651374.jpg?width=775&height=425&crop=1873,1027,x0,y67",
        "url": "Bitonio"
    },
    {
        "name": "Jedrick Wills Jr.",
        "description": "Jedrick Wills Jr. played college football at Alabama and was drafted by the Browns with the tenth overall pick in the first round of the 2020 NFL Draft. Wills grew up in Lexington, Kentucky and attended Lafayette High School. He was named first team All-State by the Associated Press as a junior and senior and was invited to play in the Under Armour All-America Game. Rated the top college prospect in the state of Kentucky, Wills committed to play college football at Alabama over offers from Kentucky, Michigan, Tennessee and Notre Dame.",
        "image_source": "https://www.wtvq.com/wp-content/uploads/2020/07/7D9B7879-3E3A-4C7A-87D8-F2684A91953C.jpeg",
        "url": "Jedrick"
    }
]